In [1]:
# Data Cleaning
# This program goes reads in a CSV file, and perfoms a number of data quality checks. Data values that fail the checks are then cleansed.

In [2]:
# Initial imports
import pandas as pd
from pathlib import Path

In [3]:
# Read in CSV and take a sample
# Take sample of data

csv_path = Path("order_data.csv")
csv_data = pd.read_csv(csv_path, index_col="order_no")
csv_data.sample(5)

           customer_no order_total  order_date
order_no
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
2356363           2124   258936.12  04-29-2019
413853121     CM458565         NaN   4/24/2019
45235825        TV4663       65.42  04-29-2019

In [4]:
# Identify DataFrame Data Types
# Retrieve DataFrame data types

csv_data.dtypes

customer_no    object
order_total    object
order_date     object
dtype: object

In [5]:
#Assess data quality by identifying the number of rows
# Identify Series count

csv_data.count()

customer_no    7
order_total    7
order_date     8
dtype: int64

In [6]:
# Assess data quality by identifying the number of times a value occurs
# Identify frequency values

csv_data["customer_no"].value_counts()

CM458565    2
AK45765     2
CJ458565    1
TV4663      1
2124        1
Name: customer_no, dtype: int64

In [7]:
# Assess data quality by checking for nulls
# Check for null values

csv_data.isnull()

            customer_no  order_total  order_date
order_no
452517125         False        False       False
45251825          False        False       False
4465241327        False        False       False
4465241327        False        False       False
413853121         False         True       False
45235825          False        False       False
2356363           False        False       False
452519232          True        False       False

In [8]:
# Assess data quality by determining the percentage of nulls
# Determine percentage of nulls

csv_data.isnull().mean() * 100

customer_no    12.5
order_total    12.5
order_date      0.0
dtype: float64

In [9]:
# Assess data quality by determining the number of nulls
# Determine number of nulls

csv_data.isnull().sum()

customer_no    1
order_total    1
order_date     0
dtype: int64

In [10]:
# Cleanse data by filling nulls with default value (i.e. "Unknown", 0, or mean() is common)
# Cleanse nulls from DataFrame by filling na

csv_data["customer_no"] = csv_data["customer_no"].fillna("Unknown")
csv_data

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
413853121     CM458565         NaN   4/24/2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232      Unknown     $141.25  01-10-2019

In [11]:
# Cleanse data by dropping nulls
# Cleaning nulls from DataFrame by dropping

csv_data = csv_data.dropna().copy()
csv_data

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232      Unknown     $141.25  01-10-2019

In [12]:
# Checking number of nulls again

csv_data.isnull().sum()

customer_no    0
order_total    0
order_date     0
dtype: int64

In [13]:
# Assess data quality by checking for duplicate rows
# Check duplicates

csv_data.duplicated()

order_no
452517125     False
45251825      False
4465241327    False
4465241327     True
45235825      False
2356363       False
452519232     False
dtype: bool

In [14]:
# Assess data quality by checking for duplicate customer_no values
# Check duplicates for specific field

csv_data["customer_no"].duplicated()

order_no
452517125     False
45251825      False
4465241327    False
4465241327     True
45235825      False
2356363       False
452519232     False
Name: customer_no, dtype: bool

In [15]:
# Cleanse data by dropping duplicates
# Clean duplicates

csv_data = csv_data.drop_duplicates().copy()

csv_data["customer_no"].duplicated()

order_no
452517125     False
45251825      False
4465241327    False
45235825      False
2356363       False
452519232     False
Name: customer_no, dtype: bool

In [16]:
# Assess data quality by using head function to sample data and identify currency symbols
# Identify if numeric field with $ symbol

csv_data.head()

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019

In [17]:
# Cleanse data by replacing currency symbols
# Clean identified numeric fields with $ symbol

csv_data["order_total"] = csv_data["order_total"].str.replace("$", "")
csv_data["order_total"]

C:\Users\rwhit\anaconda3\envs\dev\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  after removing the cwd from sys.path.

order_no
452517125        141.25
45251825          14.00
4465241327      1103.36
45235825          65.42
2356363       258936.12
452519232        141.25
Name: order_total, dtype: object

In [18]:
# Retrieve data types to confirm what needs to be converted

csv_data.dtypes

customer_no    object
order_total    object
order_date     object
dtype: object

In [19]:
# Convert `order_total` from `object` to `float`

csv_data["order_total"] = csv_data["order_total"].astype("float")

In [20]:
# Confirm conversion worked as expected

csv_data.dtypes

customer_no     object
order_total    float64
order_date      object
dtype: object